Revit 2027 API
ElementNode Properties
The ElementNode type exposes the following members.
Properties
Name | Description
Document |  Gets the document associated with the element.
ElementId |  The Id of the element.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LinkInstanceId |  The Id of the link instance for the element.
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
See Also
Reference
ElementNode Class
Autodesk.Revit.DB Namespace